{"meta":{"title":"HerTech","subtitle":"","description":"uu的博客","author":"uu","url":"https://LYFU0814.github.io","root":"/"},"pages":[{"title":"categories","date":"2023-11-07T08:53:11.000Z","updated":"2023-11-07T08:53:54.765Z","comments":false,"path":"categories/index.html","permalink":"https://lyfu0814.github.io/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2023-11-07T08:27:03.000Z","updated":"2023-11-07T08:27:31.542Z","comments":false,"path":"tags/index.html","permalink":"https://lyfu0814.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"C++软开学习路线","slug":"C-软开学习路线","date":"2023-11-07T08:49:14.000Z","updated":"2023-11-07T08:58:06.412Z","comments":true,"path":"2023/11/07/C-软开学习路线/","permalink":"https://lyfu0814.github.io/2023/11/07/C-%E8%BD%AF%E5%BC%80%E5%AD%A6%E4%B9%A0%E8%B7%AF%E7%BA%BF/","excerpt":"","text":"个人情况学历：211本硕，通信工程专业，排名均分比较靠前。 实习：导师不让实习，但是建议各位uu可以尝试投递，积累面经，但个人感觉有的话更好，没有也问题不大。 其他：基本在校期间都有获得奖学金，六级成绩比较高，有两篇已发表的论文。 个人比较认真自律，不算很聪明的类型，大家可以根据自身情况选择性地参考。 职业发展技术栈：实验室项目和自我规划，选择C++，最后工作也是C++开发方向，此外还有自学计网、操作系统、网络编程、数据库等等。 职业规划：个人还是想一直走技术路线，对编程也算得上喜欢。 工作选择：其实一直到找完工作都没有一个非常确定的方向，私企、国企、研究所都有投递，IT、IC等行业也都有投递（比较明确的是不想去银行）。 Offer：投递五十多家，目前意向大概六七家，国内大厂、手机厂、外企基本都有拿到，运营商开的比较晚，研究所建议女生不要考虑，或者不要有期待，我认识的很多很优秀的女生简历都过不了。 &#x3D;&#x3D;最重要的一点：根据自身情况，慎重考虑要不要转码，结合自己的兴趣、性格、学历整体评估，我能给出的建议非常有限。互联网整体已经基本饱和，对学历和方向的限制还是比较大的。&#x3D;&#x3D; 准备阶段时间线：研一下学期开始到找到工作大概一共一年半时间：前期用了9个月时间完成基础知识学习；数据结构和算法学习完成后开始刷题，基本持续一年时间；实验室项目做了3个月，方向比较匹配，自己又自学了一个数据中心的项目，大概三个月；最后用两个月时间总结八股，然后就是不断复习。个人觉得一年左右就能准备的比较充分，但我因为实验室比较忙所以持续比较久，大家可以根据自己的时间进行规划。 基础知识学习：包括C++、操作系统、计网、网络编程、数据库，学习路线网上也比较多，但是建议大家提前规划好，具体到哪一本书要多久看完，然后尽量按计划执行。 推荐书目：我自己更喜欢看书学习，这里推荐几本我觉得看完收获很大的书： 《C++ Primer》：我是从头到尾看了两遍，每次都有很大收获，但现在也不敢说自己懂C++； 《计算机网络-自顶向下方法》：同样很有用，而且很能看得进去； 《操作系统原理、实现与实践》：哈工大李治军老师写的书，有配套网课； 《MySQL是怎样使用的》、《MySQL是怎样实现的》：可以深入学习数据库，但如果只想了解使用看第一本就可以； 实习：有机会的uu可以申请实习，大厂最好，但是个人觉得有利有弊。好处就是企业普遍喜欢有经历的学生，弊端就是有的公司实习很累，有时候会错过秋招刚开始的提前批。而且有时候有大厂实习的话，简历可能会被一些小公司或研究所pass，在写简历的时候可以注意一下。 项目：没有实习的话项目基本上一定会被问到，一般简历上写两个项目就可以，不管是自己做的还是实验室课题，一定要非常了解，不论面试官问什么都要很快回答出来。我是学习了慕课网上的项目，但到后期感觉技术栈比较老（C和C++），面试官不太感兴趣。大家根据自己的能力选择开源项目即可（C++尽量别选webserver）。 刷题：主要包括两个部分 基本算法掌握：我是参考代码随想录的顺序做题（但我个人不喜欢知识星球和视频讲解），自己要经常总结，我在这个阶段每天3道题左右，因为是第一次做所以花时间比较久。 剑指offer：剑指offer有两本书，题目在面试中都比较常见，加起来大概200题左右。 复习阶段八股复习：完成第一轮学习后可以参考网上的复习资料进行分类整理，然后每天复习。说实话我不太喜欢这种背诵的方式，但是往往企业的面试官很喜欢考一些定式的八股。 项目复习：把自己的项目进行梳理，保证自己能够从头到尾完整讲解，可以准备一两个项目遇到的难点和解决思路，经常会问到。 刷题：如果可以的话，建议大家直到签完三方为止都要一直做题，保持手感在我看来还是挺重要的，我在整个学习和复习期间一共做了400道左右，题目数量中等&gt;简单&gt;困难，基本都有二刷三刷。 简历准备这方面网上的资料也比较多，大家可以选择各种做简历的网站，用起来很方便，但是可能需要充个十几块钱的会员。 投递投递时做好信息记录，包括投递公司名称、base、投递日期、笔试面试情况。可以海投，但也不用特别海，如果投两三百家的话秋招后期会非常累。 前期可以投一些不那么想去的厂刷刷面经，或者实习的时候提前体验面试，每次面试完都要复盘总结，然后再针对薄弱点进行加强。 面试我觉得面试最重要的有两点，第一就是自己准备的足够充分，面试自然就会不那么紧张，自我介绍、项目管理这些都可以提前准备；第二就是要自信大方，尽量把自己知道的都能讲出来，而且要有逻辑，这个多锻炼就好了。 另外非常不建议在面试时看资料或现场查答案，会非常明显，还是尽量提前准备好最重要。 以上就是我在整个找工作过程中的学习过程和心得，虽然感觉未来仍然充满不确定性，但我还是喜欢在过程中做好准备，把选择权掌握在自己手里。 希望以上可以帮到各位uu！也希望大家都可以收到还不错的offer，顺利结束自己的学生时代。","categories":[{"name":"学习随笔","slug":"学习随笔","permalink":"https://lyfu0814.github.io/categories/%E5%AD%A6%E4%B9%A0%E9%9A%8F%E7%AC%94/"}],"tags":[{"name":"学习路线","slug":"学习路线","permalink":"https://lyfu0814.github.io/tags/%E5%AD%A6%E4%B9%A0%E8%B7%AF%E7%BA%BF/"}]}],"categories":[{"name":"学习随笔","slug":"学习随笔","permalink":"https://lyfu0814.github.io/categories/%E5%AD%A6%E4%B9%A0%E9%9A%8F%E7%AC%94/"}],"tags":[{"name":"学习路线","slug":"学习路线","permalink":"https://lyfu0814.github.io/tags/%E5%AD%A6%E4%B9%A0%E8%B7%AF%E7%BA%BF/"}]}